// 业务板块与标签配置
// 字符串为单级标签，对象 { name, children } 为多级标签
export const TAG_CONFIG = {
    "cat_005": [
        "历年各院校招生专业计划表",
        {
            "name": "知识板块",
            "children": [
                "公共英语",
                "大学语文",
                "高等数学"
            ]
        },
        {
            "name": "近5年真题",
            "children": [
                "公共英语",
                "大学语文",
                "高等数学"
            ]
        }
    ],
    "cat_015": [],
    "cat_001": [
        {
            "name": "六级",
            "children": [
                "知识板块",
                "近5年真题"
            ]
        },
        {
            "name": "四级",
            "children": [
                "知识板块",
                "近5年真题"
            ]
        }
    ],
    "cat_013": [],
    "cat_006": [
        {
            "name": "知识板块",
            "children": [
                {
                    "name": "中学",
                    "children": [
                        "教育知识",
                        "综合素质"
                    ]
                },
                {
                    "name": "初中学科知识",
                    "children": [
                        "体育",
                        "信息技术",
                        "化学",
                        "历史",
                        "地理",
                        "政治",
                        "数学",
                        "物理",
                        "生物",
                        "美术",
                        "英语",
                        "语文",
                        "音乐"
                    ]
                },
                {
                    "name": "小学",
                    "children": [
                        "教育知识",
                        "综合素质"
                    ]
                },
                {
                    "name": "幼儿园",
                    "children": [
                        "保教知识",
                        "综合素质"
                    ]
                },
                {
                    "name": "高中学科知识",
                    "children": [
                        "体育",
                        "信息技术",
                        "化学",
                        "历史",
                        "地理",
                        "政治",
                        "数学",
                        "物理",
                        "生物",
                        "美术",
                        "英语",
                        "语文",
                        "音乐"
                    ]
                }
            ]
        },
        {
            "name": "近5年真题",
            "children": [
                {
                    "name": "初中",
                    "children": [
                        "体育",
                        "信息技术",
                        "化学",
                        "历史",
                        "地理",
                        "政治",
                        "教育知识",
                        "数学",
                        "物理",
                        "生物",
                        "综合素质",
                        "美术",
                        "英语",
                        "语文",
                        "音乐"
                    ]
                },
                {
                    "name": "小学",
                    "children": [
                        "教育知识",
                        "综合素质"
                    ]
                },
                {
                    "name": "幼儿园",
                    "children": [
                        "保教知识",
                        "综合素质"
                    ]
                },
                {
                    "name": "高中",
                    "children": [
                        "体育",
                        "信息技术",
                        "化学",
                        "历史",
                        "地理",
                        "政治",
                        "数学",
                        "物理",
                        "生物",
                        "综合素质",
                        "教育知识",
                        "美术",
                        "语文",
                        "音乐"
                    ]
                }
            ]
        }
    ],
    "cat_002": [
        {
            "name": "知识板块",
            "children": [
                "云南省考特色",
                "申论",
                {
                    "name": "行测",
                    "children": [
                        "判断推理",
                        "政治理论及常识",
                        "数量关系",
                        "言语理解与表达",
                        "资料分析"
                    ]
                }
            ]
        },
        {
            "name": "近5年岗位表",
            "children": [
                "国考",
                "省考"
            ]
        },
        {
            "name": "近5年真题",
            "children": [
                {
                    "name": "国考",
                    "children": [
                        "申论",
                        "行测"
                    ]
                },
                {
                    "name": "省考",
                    "children": [
                        "申论",
                        "行测"
                    ]
                }
            ]
        }
    ],
    "cat_004": [
        {
            "name": "知识板块",
            "children": [
                "政治",
                {
                    "name": "数学",
                    "children": [
                        "数学一",
                        "数学三",
                        "数学二"
                    ]
                },
                {
                    "name": "英语",
                    "children": [
                        "英语一",
                        "英语二"
                    ]
                }
            ]
        },
        {
            "name": "近5年真题",
            "children": [
                "政治",
                {
                    "name": "数学",
                    "children": [
                        "数学一",
                        "数学三",
                        "数学二"
                    ]
                },
                {
                    "name": "英语",
                    "children": [
                        "英语一",
                        "英语二"
                    ]
                }
            ]
        }
    ],
    "cat_009": [
        {
            "name": "知识板块",
            "children": [
                {
                    "name": "综应",
                    "children": [
                        "A综合管理类",
                        "B社会科学类",
                        "C自然科学类",
                        "D中小学教师类",
                        "E医疗卫生类"
                    ]
                },
                {
                    "name": "职测",
                    "children": [
                        "判断推理",
                        "常识判断",
                        "数量分析",
                        "策略选择",
                        "综合分析",
                        "言语理解与表达",
                        "资料分析"
                    ]
                }
            ]
        },
        "近5年岗位表",
        {
            "name": "近5年真题",
            "children": [
                {
                    "name": "A类综合管理",
                    "children": [
                        "综应",
                        "职测"
                    ]
                },
                {
                    "name": "B类社会科学",
                    "children": [
                        "综应",
                        "职测"
                    ]
                },
                {
                    "name": "C类自然科学",
                    "children": [
                        "综应",
                        "职测"
                    ]
                },
                {
                    "name": "D类中小学教师",
                    "children": [
                        "综应",
                        "职测"
                    ]
                },
                {
                    "name": "E类医疗卫生",
                    "children": [
                        "综应",
                        "职测"
                    ]
                }
            ]
        }
    ],
    "cat_014": [],
    "cat_007": [
        "知识板块",
        "题库"
    ],
    'cat_008': ['文案', '配图', '海报'], // 素材 (Not scanned)
    'cat_010': [] // 动态 (Not scanned)
}

export default TAG_CONFIG
